Revit 2026 API

# IFCParameterTemplateGetPropertySetApplicableEntities Method

---

Gets the list of IFC entities to which the property set is applicable.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<string> GetPropertySetApplicableEntities(
	PropertySetupType propertySetupType,
	string propertySetName
)
```
```vb
Public Function GetPropertySetApplicableEntities (
	propertySetupType As PropertySetupType,
	propertySetName As String
) As IList(Of String)
```
```cpp
public:
IList<String^>^ GetPropertySetApplicableEntities(
	PropertySetupType propertySetupType,
	String^ propertySetName
)
```
```fsharp
member GetPropertySetApplicableEntities :
        propertySetupType : PropertySetupType *
        propertySetName : string -> IList<string>
```

#### Parameters

propertySetupType PropertySetupType
     The property setup type.
propertySetName String
     The property set name.

#### Return Value

IListString The list of IFC entities to which the property set is applicable.

| Exception | Condition |
| --- | --- |
| ArgumentException | A property set with the given name is not present in the template. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

IFCParameterTemplate Class

Autodesk.Revit.DB Namespace